## 1. Stock Tweets Data Cleaning

In [163]:
import pandas as pd

tweets_df = pd.read_csv('stock_tweets.csv')
tweets_df.head()

,Date,Tweet,Stock Name,Company Name
0,2022-09-29 23:41:16+00:00,Mainstream media has done an amazing job at br...,TSLA,"Tesla, Inc."
1,2022-09-29 23:24:43+00:00,Tesla delivery estimates are at around 364k fr...,TSLA,"Tesla, Inc."
2,2022-09-29 23:18:08+00:00,3/ Even if I include 63.0M unvested RSUs as of...,TSLA,"Tesla, Inc."
3,2022-09-29 22:40:07+00:00,@RealDanODowd @WholeMarsBlog @Tesla Hahaha why...,TSLA,"Tesla, Inc."
4,2022-09-29 22:27:05+00:00,"@RealDanODowd @Tesla Stop trying to kill kids,...",TSLA,"Tesla, Inc."

In [164]:
# Looking for missing values in all of the columns
tweets_df.isna().sum()

Date            0
Tweet           0
Stock Name      0
Company Name    0
dtype: int64

In [165]:
# Checking for duplicates across all columns
duplicates = tweets_df.duplicated()
duplicates

0        False
1        False
2        False
3        False
4        False
         ...
80788    False
80789    False
80790    False
80791    False
80792    False
Length: 80793, dtype: bool

In [166]:
# Converting date column to datetime data type
tweets_df['Date'] = pd.to_datetime(tweets_df['Date']).dt.date
tweets_df['Date']

0        2022-09-29
1        2022-09-29
2        2022-09-29
3        2022-09-29
4        2022-09-29
            ...
80788    2021-10-07
80789    2021-10-04
80790    2021-10-01
80791    2021-10-01
80792    2021-09-30
Name: Date, Length: 80793, dtype: object

In [167]:
max_date = tweets_df['Date'].max()

min_date = tweets_df['Date'].min()
print("Tweets range from", min_date, "to", max_date)

Tweets range from 2021-09-30 to 2022-09-29

In [193]:
# Converting Dataframe to CSV file

tweets_df.to_csv("Cleaned_Stock_Tweets.csv", index = False)

### Grouping Tech Stocks

In [168]:
# Select only specific tech stocks from the dataset
tech_tweets_df = tweets_df.loc[tweets_df['Stock Name'].isin(['TSLA', 'AAPL', 'GOOG', 'INTC', 'META', 'MSFT'])]
tech_tweets_df

,Date,Tweet,Stock Name,Company Name
0,2022-09-29,Mainstream media has done an amazing job at br...,TSLA,"Tesla, Inc."
1,2022-09-29,Tesla delivery estimates are at around 364k fr...,TSLA,"Tesla, Inc."
2,2022-09-29,3/ Even if I include 63.0M unvested RSUs as of...,TSLA,"Tesla, Inc."
3,2022-09-29,@RealDanODowd @WholeMarsBlog @Tesla Hahaha why...,TSLA,"Tesla, Inc."
4,2022-09-29,"@RealDanODowd @Tesla Stop trying to kill kids,...",TSLA,"Tesla, Inc."
...,...,...,...,...
75810,2021-10-17,A packed earnings week!\n\n$STT\n$ELS\n$ACO\n$...,INTC,Intel Corporation
75811,2021-10-16,ðŸ’¥BIG WEEK OF Q3 EARNINGS AHEAD ðŸ‘€ðŸ‘€\n\nMon: -\nT...,INTC,Intel Corporation
75812,2021-10-16,A packed earnings week!\n\n$STT\n$ELS\n$ACO\n$...,INTC,Intel Corporation
75813,2021-10-14,TSMC node transitions are slowing down heavily...,INTC,Intel Corporation
75814,2021-10-07,Confirmed #earnings for October \n\nhttps://t....,INTC,Intel Corporation

In [169]:
# Creating dataframes for each stock and converting into CSV files
stock_groups = tech_tweets_df.groupby('Stock Name')
stock_dfs = {stock: group.copy() for stock, group in stock_groups}

for stock_name in stock_dfs:
    curr_df = stock_dfs[stock_name]
    curr_df.to_csv(stock_name + "_data.csv", index = False)

## 2.  Data Cleaning Stock Finance Data

In [170]:
import pandas as pd

finance_df = pd.read_csv('stock_yfinance_data.csv')
finance_df.head()

,Date,Open,High,Low,Close,Adj Close,Volume,Stock Name
0,2021-09-30,260.333344,263.043335,258.333344,258.493347,258.493347,53868000,TSLA
1,2021-10-01,259.466675,260.260010,254.529999,258.406677,258.406677,51094200,TSLA
2,2021-10-04,265.500000,268.989990,258.706665,260.510010,260.510010,91449900,TSLA
3,2021-10-05,261.600006,265.769989,258.066681,260.196655,260.196655,55297800,TSLA
4,2021-10-06,258.733337,262.220001,257.739990,260.916656,260.916656,43898400,TSLA

In [171]:
# Converting date column to datetime data type
finance_df['Date'] = pd.to_datetime(finance_df['Date']).dt.date
finance_df['Date']

0       2021-09-30
1       2021-10-01
2       2021-10-04
3       2021-10-05
4       2021-10-06
           ...
6295    2022-09-23
6296    2022-09-26
6297    2022-09-27
6298    2022-09-28
6299    2022-09-29
Name: Date, Length: 6300, dtype: object

In [172]:
max_date = finance_df['Date'].max()

min_date = finance_df['Date'].min()
print("Stocks range from", min_date, "to", max_date)

Stocks range from 2021-09-30 to 2022-09-29

In [173]:
# Looking for missing values in all of the columns
finance_df.isna().sum()

Date          0
Open          0
High          0
Low           0
Close         0
Adj Close     0
Volume        0
Stock Name    0
dtype: int64

In [174]:
duplicates = finance_df.duplicated()
duplicates

0       False
1       False
2       False
3       False
4       False
        ...
6295    False
6296    False
6297    False
6298    False
6299    False
Length: 6300, dtype: bool

In [194]:
# Converting Dataframe to CSV file

finance_df.to_csv("Cleaned_Finance_Stock.csv", index = False)

### Grouping Finance Data by Tech Stocks

In [175]:
# Grouping stocks that belong to the list of tech stocks we are looking at
tech_finance_df = finance_df.loc[finance_df['Stock Name'].isin(['TSLA', 'AAPL', 'GOOG', 'INTC', 'META', 'MSFT'])]
tech_finance_df

,Date,Open,High,Low,Close,Adj Close,Volume,Stock Name
0,2021-09-30,260.333344,263.043335,258.333344,258.493347,258.493347,53868000,TSLA
1,2021-10-01,259.466675,260.260010,254.529999,258.406677,258.406677,51094200,TSLA
2,2021-10-04,265.500000,268.989990,258.706665,260.510010,260.510010,91449900,TSLA
3,2021-10-05,261.600006,265.769989,258.066681,260.196655,260.196655,55297800,TSLA
4,2021-10-06,258.733337,262.220001,257.739990,260.916656,260.916656,43898400,TSLA
...,...,...,...,...,...,...,...,...
4279,2022-09-23,27.900000,27.900000,27.190001,27.520000,27.153267,43491100,INTC
4280,2022-09-26,27.559999,27.700001,26.860001,26.969999,26.610596,44786400,INTC
4281,2022-09-27,27.400000,27.600000,26.620001,26.889999,26.531662,44121400,INTC
4282,2022-09-28,26.860001,27.280001,26.600000,27.129999,26.768463,40433400,INTC
4283,2022-09-29,26.780001,26.780001,26.190001,26.379999,26.028458,41831300,INTC

In [176]:
# Creating dataframes for each stock and converting into CSV files
stock_finance_groups = tech_finance_df.groupby('Stock Name')
stock_finance_dfs = {stock: group.copy() for stock, group in stock_finance_groups}

for stock_name in stock_finance_dfs:
    curr_df = stock_finance_dfs[stock_name]
    curr_df.to_csv(stock_name + "_finance_data.csv", index = False)

## 3. Merging Finance and Tweet Dataframes on Date and Stock Name

In [177]:
stock_finance_dfs['AAPL'].columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume',
       'Stock Name'],
      dtype='object')

In [178]:
stock_dfs['AAPL'].columns

Index(['Date', 'Tweet', 'Stock Name', 'Company Name'], dtype='object')

In [179]:
merged_dfs = {}
for stock_name in stock_finance_dfs:
    finance_df = stock_finance_dfs[stock_name]
    tweet_df = stock_dfs[stock_name]

    # Merge on Date and Stock Name
    merged_df = pd.merge(finance_df, tweet_df, on=['Date', 'Stock Name'], how='left')

    # Store result
    merged_dfs[stock_name] = merged_df

In [180]:
print('AAPL:')
print(merged_dfs['AAPL'].isna().sum())

AAPL:
Date            0
Open            0
High            0
Low             0
Close           0
Adj Close       0
Volume          0
Stock Name      0
Tweet           0
Company Name    0
dtype: int64

In [181]:
print('GOOG:')
print(merged_dfs['GOOG'].isna().sum())

GOOG:
Date             0
Open             0
High             0
Low              0
Close            0
Adj Close        0
Volume           0
Stock Name       0
Tweet           14
Company Name    14
dtype: int64

In [182]:
missing_tweets_rows = merged_dfs['GOOG'][merged_dfs['GOOG'].isnull().any(axis=1)]
missing_tweets_rows

,Date,Open,High,Low,Close,Adj Close,Volume,Stock Name,Tweet,Company Name
13,2021-10-08,139.906006,140.317001,139.429352,140.056000,140.056000,18924000,GOOG,NaN,NaN
15,2021-10-12,139.637497,139.695007,136.250000,136.712997,136.712997,22536000,GOOG,NaN,NaN
19,2021-10-15,142.199997,142.199997,141.064499,141.675003,141.675003,21250000,GOOG,NaN,NaN
96,2021-11-10,148.009750,148.699997,145.324997,146.626007,146.626007,22708000,GOOG,NaN,NaN
97,2021-11-11,147.106995,148.502243,146.694504,146.748001,146.748001,12464000,GOOG,NaN,NaN
113,2021-11-18,149.145996,151.610001,148.998505,150.709000,150.709000,26658000,GOOG,NaN,NaN
121,2021-11-24,146.350006,147.000000,145.199005,146.717499,146.717499,16464000,GOOG,NaN,NaN
139,2021-12-09,148.175995,149.604996,147.529007,148.106003,148.106003,18580000,GOOG,NaN,NaN
524,2022-03-28,140.684494,141.976501,139.828156,141.949997,141.949997,23774000,GOOG,NaN,NaN
942,2022-08-01,115.529999,117.120003,114.690002,115.480003,115.480003,22856200,GOOG,NaN,NaN
943,2022-08-02,114.430000,117.080002,114.260002,115.900002,115.900002,17911000,GOOG,NaN,NaN
950,2022-08-05,116.930000,118.860001,116.709999,118.220001,118.220001,15615700,GOOG,NaN,NaN
1051,2022-09-23,100.059998,100.110001,98.010002,99.169998,99.169998,25657000,GOOG,NaN,NaN
1056,2022-09-27,99.910004,100.459999,97.339996,98.089996,98.089996,24225000,GOOG,NaN,NaN

In [183]:
merged_dfs['GOOG'] = merged_dfs['GOOG'].dropna(subset = ['Tweet', 'Company Name']).reset_index(drop = True)

print('GOOG:')
print(merged_dfs['GOOG'].isna().sum())

GOOG:
Date            0
Open            0
High            0
Low             0
Close           0
Adj Close       0
Volume          0
Stock Name      0
Tweet           0
Company Name    0
dtype: int64

In [184]:
print('META:')
print(merged_dfs['META'].isna().sum())

META:
Date             0
Open             0
High             0
Low              0
Close            0
Adj Close        0
Volume           0
Stock Name       0
Tweet           33
Company Name    33
dtype: int64

In [185]:
missing_tweets_rows = merged_dfs['META'][merged_dfs['META'].isnull().any(axis=1)]
missing_tweets_rows

,Date,Open,High,Low,Close,Adj Close,Volume,Stock Name,Tweet,Company Name
2261,2022-06-14,166.029999,166.750000,161.360001,163.729996,163.729996,27244300,META,NaN,NaN
2268,2022-06-22,158.380005,160.789993,155.440002,155.850006,155.850006,47267800,META,NaN,NaN
2271,2022-06-24,161.729996,170.250000,161.300003,170.160004,170.160004,68736000,META,NaN,NaN
2272,2022-06-27,171.320007,171.750000,168.009995,169.490005,169.490005,29174600,META,NaN,NaN
2273,2022-06-28,169.899994,171.300003,160.610001,160.679993,160.679993,27744500,META,NaN,NaN
2274,2022-06-29,163.570007,166.330002,160.320007,163.940002,163.940002,28595200,META,NaN,NaN
2275,2022-06-30,162.149994,165.229996,158.490005,161.250000,161.250000,35250600,META,NaN,NaN
2277,2022-07-05,158.139999,168.250000,157.020004,168.190002,168.190002,28618600,META,NaN,NaN
2278,2022-07-06,168.199997,171.589996,165.460007,169.770004,169.770004,23085900,META,NaN,NaN
2283,2022-07-12,164.800003,165.910004,162.100006,163.270004,163.270004,16639700,META,NaN,NaN
2284,2022-07-13,160.160004,164.979996,159.610001,163.490005,163.490005,16555100,META,NaN,NaN
2285,2022-07-14,161.220001,162.589996,157.279999,158.050003,158.050003,23765200,META,NaN,NaN
2292,2022-07-25,169.000000,170.570007,164.809998,166.649994,166.649994,26166300,META,NaN,NaN
2297,2022-07-29,157.690002,160.139999,155.169998,159.100006,159.100006,42065400,META,NaN,NaN
2301,2022-08-04,168.300003,172.149994,166.800003,170.570007,170.570007,23938200,META,NaN,NaN
2303,2022-08-08,168.000000,177.509995,167.130005,170.250000,170.250000,27299100,META,NaN,NaN
2305,2022-08-10,175.990005,180.479996,173.949997,178.339996,178.339996,30262100,META,NaN,NaN
2308,2022-08-12,180.809998,181.460007,178.910004,180.500000,180.500000,21274000,META,NaN,NaN
2309,2022-08-15,178.960007,181.440002,178.199997,180.889999,180.889999,15878700,META,NaN,NaN
2312,2022-08-18,174.339996,175.759995,171.860001,174.660004,174.660004,18844500,META,NaN,NaN
2314,2022-08-22,165.490005,165.490005,162.259995,163.050003,163.050003,19499700,META,NaN,NaN
2321,2022-08-29,160.660004,163.050003,159.009995,159.169998,159.169998,20052700,META,NaN,NaN
2322,2022-08-30,160.350006,161.660004,155.910004,157.160004,157.160004,19567900,META,NaN,NaN
2323,2022-08-31,167.070007,167.839996,162.139999,162.929993,162.929993,40953000,META,NaN,NaN
2324,2022-09-01,163.580002,167.360001,160.350006,165.360001,165.360001,30145700,META,NaN,NaN
2326,2022-09-06,160.100006,161.690002,157.690002,158.539993,158.539993,19339800,META,NaN,NaN
2329,2022-09-09,163.250000,169.539993,163.020004,169.149994,169.149994,22086800,META,NaN,NaN
2330,2022-09-12,167.389999,171.389999,167.279999,168.960007,168.960007,23220400,META,NaN,NaN
2331,2022-09-13,161.539993,161.630005,152.669998,153.130005,153.130005,44444100,META,NaN,NaN
2345,2022-09-23,141.419998,142.619995,138.889999,140.410004,140.410004,31710700,META,NaN,NaN
2346,2022-09-26,140.119995,142.240005,136.190002,136.369995,136.369995,30497000,META,NaN,NaN
2347,2022-09-27,137.919998,139.419998,134.119995,134.399994,134.399994,30826500,META,NaN,NaN
2348,2022-09-28,134.619995,142.029999,134.270004,141.610001,141.610001,32658500,META,NaN,NaN

In [186]:
merged_dfs['META'] = merged_dfs['META'].dropna(subset = ['Tweet', 'Company Name']).reset_index(drop = True)

print('META:')
print(merged_dfs['META'].isna().sum())

META:
Date            0
Open            0
High            0
Low             0
Close           0
Adj Close       0
Volume          0
Stock Name      0
Tweet           0
Company Name    0
dtype: int64

In [187]:
print('MSFT:')
print(merged_dfs['MSFT'].isna().sum())

MSFT:
Date            0
Open            0
High            0
Low             0
Close           0
Adj Close       0
Volume          0
Stock Name      0
Tweet           0
Company Name    0
dtype: int64

In [188]:
print('TSLA:')
print(merged_dfs['TSLA'].isna().sum())

TSLA:
Date            0
Open            0
High            0
Low             0
Close           0
Adj Close       0
Volume          0
Stock Name      0
Tweet           0
Company Name    0
dtype: int64

In [189]:
print('INTC:')
print(merged_dfs['INTC'].isna().sum())

INTC:
Date              0
Open              0
High              0
Low               0
Close             0
Adj Close         0
Volume            0
Stock Name        0
Tweet           119
Company Name    119
dtype: int64

In [190]:
missing_tweets_rows = merged_dfs['INTC'][merged_dfs['INTC'].isnull().any(axis=1)]
missing_tweets_rows

,Date,Open,High,Low,Close,Adj Close,Volume,Stock Name,Tweet,Company Name
0,2021-09-30,53.759998,53.980000,53.259998,53.279999,50.892117,20534100,INTC,NaN,NaN
1,2021-10-01,53.650002,54.110001,53.049999,53.860001,51.446125,19895100,INTC,NaN,NaN
2,2021-10-04,53.930000,54.330002,53.080002,53.470001,51.073605,27353300,INTC,NaN,NaN
3,2021-10-05,53.549999,54.340000,53.480000,53.950001,51.532089,18129400,INTC,NaN,NaN
4,2021-10-06,53.480000,54.070000,53.070000,53.980000,51.560745,20059600,INTC,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
330,2022-08-31,32.389999,32.389999,31.770000,31.920000,31.494633,44074500,INTC,NaN,NaN
333,2022-09-06,31.389999,31.389999,30.330000,30.360001,29.955421,46989600,INTC,NaN,NaN
340,2022-09-12,31.740000,31.860001,31.100000,31.559999,31.139429,38305500,INTC,NaN,NaN
345,2022-09-14,29.549999,29.770000,29.010000,29.180000,28.791145,40767200,INTC,NaN,NaN
352,2022-09-20,29.070000,29.170000,28.709999,28.959999,28.574078,31129000,INTC,NaN,NaN

In [191]:
merged_dfs['INTC'] = merged_dfs['INTC'].dropna(subset = ['Tweet', 'Company Name']).reset_index(drop = True)

print('INTC:')
print(merged_dfs['INTC'].isna().sum())

INTC:
Date            0
Open            0
High            0
Low             0
Close           0
Adj Close       0
Volume          0
Stock Name      0
Tweet           0
Company Name    0
dtype: int64

In [192]:
# Converting dataframes to CSV files
for stock_name in merged_dfs:
    curr_df = merged_dfs[stock_name]
    tweets_column = curr_df.pop('Tweet')
    curr_df.insert(1, 'Tweet', tweets_column)
    curr_df.to_csv(stock_name + "_merged_data.csv", index = False)